#include <stdio.h>

int main(){

//how to calculate operators

printf("%d",(4/2)); //หารปกติ
printf("\n%d",(9%4)); //หารเอาเศษ
printf("\n%d,%d",(6/3),(7%3)); //หาร 2 ตัวเลขปกติ
printf("\n%f",(double)(9/4)); //ทำในวงเล็บก่อน หารแล้วเหลือ 2 เศษไม่นับ แล้ว คำตอบแปลงเป็น double ไม่กำหนดทศนิยม=6ตำแหน่ง
printf("\n%.2f",(double)9/4); //9 ถูกกำหนดเป็น double กลายเป็น 9.000000/4 = 2.25 (คำตอบทศนิยมตามจริง) .2f= ทศนิยม 2 ตำแหน่ง
printf("\n%f",(double)9.1/4); //9.1 ถูกกำหนดเป็น double กลายเป็น 9.100000/4 = 2.275000 (คำตอบทศนิยมตามจริง)
printf("\n%.2f",(double)9.1/4); //.2f= ทศนิยม 2 ตำแหน่ง เหมือนข้อด้านบนแต่เมื่อกำหนดให้คำตอบเป็นทศนิยม 2 ตำแหน่ง ดูตำแหน่งที่3ว่าปัดขึ้นหรือลง
printf("\n%f",(double)9.3/4); //9.3 ถูกกำหนดเป็น double กลายเป็น 9.300000/4 = 2.325000 (คำตอบทศนิยมตามจริง)
printf("\n%.2f",(double)9.3/4); //.2f= ทศนิยม 2 ตำแหน่ง เหมือนข้อด้านบนแต่เมื่อกำหนดให้คำตอบเป็นทศนิยม 2 ตำแหน่ง ดูตำแหน่งที่3ว่าปัดขึ้นหรือลง
// *********** เหมือนจะเป็นบัคเพราะทั้ง 9.1 และ 9.3 เหลือเศษ 5 เหมือนกัน แต่ตัวนึงปัดลง(หรือไม่คิด) ต้องถามอาจารย์

printf("\n%.2f",(double)(9/4)); // คิดในวงเล็บ (9/4) ก่อน ได้ 2 แล้วมากำหนดเป็น double ได้ 2.00
double x =14/5*100+32-9.0; // คิดปกติก่อน แล้วแปลงเป็น double (223.000000) แต่ print ออก int เหลือ 223
printf("\n%d",(int)x); //
printf("\n%.2f",(double)9/4); //
printf("\n%.2f",(int)21/9.0); //
printf("\n%.2f",(float)5.165); // .5 ยังปัดลง ทำไม? *********
printf("\n%.2f",(float)5.166); // .6 ขึ้นไปปัดขึ้นปกติ
printf("\n%.2f",(double)2.275); // จากข้อด้านบนทำไม .5 นี้ถึงปัดลง ***********
printf("\n%.2f",(double)2.325); // แต่ .5 นี้ปัดขึ้น
printf("\n%.2f",(float)2.275); // จากข้อด้านบนแต่ลองใช้ float (.5 ปัดขึ้นปกติ float เหมาะใช้ปัดเศษมากกว่า)
printf("\n%.2f",(float)2.325); // จากข้อด้านบนแต่ลองใช้ float (.5 ปัดขึ้นปกติ float เหมาะใช้ปัดเศษมากกว่า)


    return 0;
}